{
  "Navbar": {
    "Home": "home",
    "AboutMe": "about me",
    "Skills": "skills",
    "Work": "experience",
    "Projects": "projects",
    "Contact": "contact",
    "Message": "message"
  },

  "IntroPage": {
    "greeting": "Hey, I'm ",
    "presentation": "I transform ideas into reality through code and design"
  },

  "AboutPage": {
    "title": "About Me",
    "greetings": "Hi! I'm a",
    "job": "Full Stack Developer",
    "about": "specializing in frontend development. I enjoy coming up with some ideas and transforming them into cool web applications.",
    "objective": "I am looking for exciting challenges where I can add value and promote positive changes. I am determined to overcome obstacles and deepen my skills in the field."
  },

  "SkillsPage": {
    "title": "Skills",
    "content": "Technologies / Libraries I've worked with:"
  },

  "WorkPage": {
    "title": "Experience",
    "job": "Full-Stack Software Developer at ",
    "company": "Youtan",
    "status": "Internship | Sep 2023 - Present",
    "job_description": "Developing interactive and responsive user interfaces with TypeScript and React, focusing on reusable components and backend data integration. Building and maintaining web applications using the Django framework for robust systems and business logic, along with Django Rest Framework for API creation. Efficiently querying Microsoft SQL Server databases for data manipulation.",
    "text_button": "Download Resume"
  },

  "CV": "cv/LucasCunegundes-resume.pdf",

  "ProjectsPage": {
    "title": "Projects",
    "social_media_dashboard_description": "Designed to offer insights into social media presence, this dashboard app provides detailed statistics on user engagement and post performance. By aggregating data from various social media platforms, it offers valuable information about user activity, including engagement rates and post reach.",
    "bibliotech_description": "The Bibliotech is a comprehensive library management system designed to simplify and enhance library administration. This project aims to provide a comprehensive solution for managing books, loans, and library users, streamlining the process of cataloging, loan tracking, and user management within libraries.",
    "company_hub_description": "The Company Hub is a dynamic platform dedicated to optimizing the flow of business management and organization. It provides a comprehensive set of tools and resources to facilitate efficient management of documentation and clients. By centralizing business processes and client interactions, it enhances productivity and streamlines operations for businesses of all sizes.",
    "under_construction_title": "🚧 Under construction... 🚧",
    "under_construction_description": "Take a coffee break and hang tight, I'm working on a new project"
  },

  "ContactPage": {
    "title": "Contact Me",
    "description": "Hey! Ready to create some awesome web applications? Drop me a line, and let's ",
    "strong_message": "turn your ideas into reality!",
    "name_input": "Enter your name",
    "email_input": "Enter your email",
    "message_input": "Type your message",
    "submit": "Submit",
    "text_button": "Send message",
    "toast_title": "Your message was sent!!",
    "toast_description": "Thank you, I'll respond right away",
    "zod_user_name": "Oops! Looks like you forgot to tell me your name 😅",
    "zod_user_email": "Hmm... This email looks weird 🤔 Are you sure that's your email?",
    "zod_user_message": "Your message is empty... 📝"
  },

  "MessagePage": {
    "title": "Contact Me",
    "description": "Great! Send me a message using the form, and let's start building something ",
    "strong_message": "amazing together!",
    "go_back": "Go back"
  }
}
