{
  "Navbar": {
    "Home": "home",
    "AboutMe": "sobre mim",
    "Skills": "habilidades",
    "Work": "experiência",
    "Projects": "projetos",
    "Contact": "contato",
    "Message": "message"
  },

  "IntroPage": {
    "greeting": "Olá, Sou o ",
    "presentation": "Converto ideias em soluções reais por meio da tecnologia"
  },

  "AboutPage": {
    "title": "Sobre mim",
    "greetings": "Olá! Sou um",
    "job": "Desenvolvedor Full Stack",
    "about": "motivado pelo aprendizado contínuo, almejo novos desafios que me permitam transformá-los em soluções de software incríveis.",
    "objective": "Estou em busca de desafios empolgantes, onde posso agregar valor e promover o sucesso nos projetos em que trabalho. Estou determinado a superar obstáculos e aprofundar minhas habilidades na área."
  },

  "SkillsPage": {
    "title": "Habilidades",
    "content": "Tecnologias que já trabalhei:"
  },

  "WorkPage": {
    "title": "Experiência",
    "job": "Desenvolvedor de Software Full-Stack na ",
    "company": "Youtan",
    "status": "Set 2023 - Nov 2024",
    "job_description1": "Criação e resolução de Procedures SQL complexas para relatórios SPED utilizando Microsoft SQL Server, garantindo conformidade com regulamentações e otimizando o fluxo de desenvolvimento em projetos fiscais.",
    "job_description2": "Desenvolvimento de ferramentas personalizadas para extração e validação de dados em projetos Django, automatizando processos em volumes acima de 100 mil linhas de dados em Procedures SQL e arquivos SPED. Essas soluções reduziram o tempo necessário para validação de relatórios fiscais, minimizaram o retrabalho e erros humanos em até 80%, e aumentaram a eficiência operacional ao prever possíveis inconsistências antes do envio dos relatórios para homologação e produção.",
    "job_description3": "Criação e execução de testes unitários abrangentes, garantindo 70% de cobertura de testes em projetos críticos e reduzindo os erros detectados em homologação e produção, contribuindo para maior estabilidade e confiabilidade dos sistemas entregues.",
    "text_button": "Baixar Currículo"
  },

  "CV": "cv/LucasCunegundes-curriculo.pdf",

  "ProjectsPage": {
    "title": "Projetos",
    "social_media_dashboard_description": "Projetado para oferecer insights sobre a presença em mídias sociais, este aplicativo de painel fornece estatísticas detalhadas sobre o engajamento do usuário e o desempenho das postagens. Ao agregar dados de várias plataformas de mídia social, ele oferece informações valiosas sobre a atividade do usuário, incluindo taxas de engajamento e alcance de postagens.",
    "bibliotech_description": "O Bibliotech é um sistema abrangente de gerenciamento de bibliotecas projetado para simplificar e aprimorar a administração de bibliotecas. Este projeto tem como objetivo fornecer uma solução abrangente para o gerenciamento de livros, empréstimos e usuários, simplificando o processo de catalogação, rastreamento de empréstimos e gerenciamento de usuários dentro das bibliotecas.",
    "company_hub_description": "O Company Hub é uma plataforma dinâmica dedicada à otimização do fluxo de gerenciamento e organização empresarial. Ele fornece um conjunto abrangente de ferramentas e recursos para facilitar o gerenciamento eficiente de documentos e clientes. Ao centralizar os processos de negócios e as interações com clientes, ele aumenta a produtividade e simplifica as operações para empresas de todos os tamanhos.",
    "under_construction_title": "🚧 Em construção... 🚧",
    "under_construction_description": "Pegue um café e se aconchegue, estou trabalhando em um novo projeto"
  },

  "ContactPage": {
    "title": "Entre em contato",
    "description": "Hey! Pronto para criar aplicativos web incríveis? Mande uma mensagem e vamos ",
    "strong_message": "transformar suas ideias em realidade!",
    "name_input": "Insira seu nome",
    "email_input": "Insira seu email",
    "message_input": "Insira sua mensagem",
    "submit": "Enviar",
    "text_button": "Mandar mensagem",
    "toast_title": "Sua mensagem foi enviada!!",
    "toast_description": "Muito obrigado, irei responder já já",
    "zod_user_name": "Oops! Parece que você esqueceu de me contar seu nome 😅",
    "zod_user_email": "Hmm... Que email estranho 🤔 Tem certeza que é seu email?",
    "zod_user_message": "Pelo jeito você esqueceu de escrever sua mensagem... 📝"
  },

  "MessagePage": {
    "title": "Entre em contato",
    "description": "Ótimo! Envie uma mensagem por esse formulário e vamos começar a desenvolver algo ",
    "strong_message": "incrível juntos!",
    "go_back": "Voltar"
  }
}
