{
  "Navbar": {
    "Home": "home",
    "AboutMe": "sobre mim",
    "Skills": "habilidades",
    "Work": "experiência",
    "Projects": "projetos",
    "Contact": "contato",
    "Message": "message"
  },

  "IntroPage": {
    "greeting": "Olá, Sou o ",
    "presentation": "Transformo ideias em realidade através de código e design"
  },

  "AboutPage": {
    "title": "Sobre mim",
    "greetings": "Olá! Sou um",
    "job": "Desenvolvedor Full Stack",
    "about": "se especializando em desenvolvimento frontend. Gosto de criar algumas ideias e transformá-las em aplicativos web incríveis.",
    "objective": "Estou em busca de desafios empolgantes, onde posso agregar valor e promover mudanças positivas. Estou determinado a superar obstáculos e aprofundar minhas habilidades na área."
  },

  "SkillsPage": {
    "title": "Habilidades",
    "content": "Tecnologias / Bibliotecas que já trabalhei:"
  },

  "WorkPage": {
    "title": "Experiência",
    "job": "Desenvolvedor de Software Full-Stack na ",
    "company": "Youtan",
    "status": "Estágio | Set 2023 - Atualmente",
    "job_description": "Desenvolvendo interfaces de usuário interativas e responsivas com TypeScript e React, com foco em componentes reutilizáveis e integração de dados no backend. Construindo e mantendo aplicações web utilizando o framework Django para sistemas robustos e lógica de negócios, juntamente com o Django Rest Framework para criação de APIs. Consultando eficientemente bancos de dados Microsoft SQL Server para manipulação de dados.",
    "text_button": "Baixar Currículo"
  },

  "CV": "cv/LucasCunegundes-curriculo.pdf",

  "ProjectsPage": {
    "title": "Projetos",
    "social_media_dashboard_description": "Projetado para oferecer insights sobre a presença em mídias sociais, este aplicativo de painel fornece estatísticas detalhadas sobre o engajamento do usuário e o desempenho das postagens. Ao agregar dados de várias plataformas de mídia social, ele oferece informações valiosas sobre a atividade do usuário, incluindo taxas de engajamento e alcance de postagens.",
    "bibliotech_description": "O Bibliotech é um sistema abrangente de gerenciamento de bibliotecas projetado para simplificar e aprimorar a administração de bibliotecas. Este projeto tem como objetivo fornecer uma solução abrangente para o gerenciamento de livros, empréstimos e usuários, simplificando o processo de catalogação, rastreamento de empréstimos e gerenciamento de usuários dentro das bibliotecas.",
    "company_hub_description": "O Company Hub é uma plataforma dinâmica dedicada à otimização do fluxo de gerenciamento e organização empresarial. Ele fornece um conjunto abrangente de ferramentas e recursos para facilitar o gerenciamento eficiente de documentos e clientes. Ao centralizar os processos de negócios e as interações com clientes, ele aumenta a produtividade e simplifica as operações para empresas de todos os tamanhos.",
    "under_construction_title": "🚧 Em construção... 🚧",
    "under_construction_description": "Pegue um café e se aconchegue, estou trabalhando em um novo projeto"
  },

  "ContactPage": {
    "title": "Entre em contato",
    "description": "Hey! Pronto para criar aplicativos web incríveis? Mande uma mensagem e vamos ",
    "strong_message": "transformar suas ideias em realidade!",
    "name_input": "Insira seu nome",
    "email_input": "Insira seu email",
    "message_input": "Insira sua mensagem",
    "submit": "Enviar",
    "text_button": "Mandar mensagem",
    "toast_title": "Sua mensagem foi enviada!!",
    "toast_description": "Muito obrigado, irei responder já já",
    "zod_user_name": "Oops! Parece que você esqueceu de me contar seu nome 😅",
    "zod_user_email": "Hmm... Que email estranho 🤔 Tem certeza que é seu email?",
    "zod_user_message": "Pelo jeito você esqueceu de escrever sua mensagem... 📝"
  },

  "MessagePage": {
    "title": "Entre em contato",
    "description": "Ótimo! Envie uma mensagem por esse formulário e vamos começar a desenvolver algo ",
    "strong_message": "incrível juntos!",
    "go_back": "Voltar"
  }
}
